tests/fixtures/artifact-replay/single-region-success/case/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0     0     0)
    (0.1   0     0)
    (0.1   0.1   0)
    (0     0.1   0)
    (0     0     0.01)
    (0.1   0     0.01)
    (0.1   0.1   0.01)
    (0     0.1   0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (0 4 7 3)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
