tests/fixtures/artifact-replay/single-region-success/case/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     icoFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.5;

deltaT          0.005;

writeControl    timeStep;
writeInterval   20;

purgeWrite      0;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   6;

runTimeModifiable false;
